2024.08.04

In [32]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series(['a','a','v','c']*4)
obj

0     a
1     a
2     v
3     c
4     a
5     a
6     v
7     c
8     a
9     a
10    v
11    c
12    a
13    a
14    v
15    c
dtype: object

In [6]:
obj.describe() # 기술 통계
#

count     16
unique     3
top        a
freq       8
dtype: object

pickle

In [7]:
'''
import pickle
피클 파일은 텍스트로 저장 X 객체를 저장 O
dict(list,df,series,...) 저장된 정제된 텍스트를 바이너리 형식으로 파일에 저장(.pkl)
바이너리 특징 = 속도가 매우 빠름, 용량이 작음
'''

'\nimport pickle\n피클 파일은 텍스트로 저장 X 객체를 저장 O\ndict(list,df,series,...) 저장된 정제된 텍스트를 바이너리 형식으로 파일에 저장(.pkl)\n바이너리 특징 = 속도가 매우 빠름, 용량이 작음\n'

In [9]:
import pickle

In [11]:
myList = ['a','b']
with open('pickle_ex1.pkl', 'wb') as f:
    pickle.dump(myList, f) # 파일화를 하겠다.

In [13]:
f = open('pickle_ex1.pkl', 'rb')
pickle.load(f)

['a', 'b']

In [14]:
price = pd.read_pickle('data/examples/yahoo_price.pkl')
volume = pd.read_pickle('data/examples/yahoo_volume.pkl')

In [16]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [17]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [21]:
returns = price.pct_change()    # pct_change = 이전 데이터의 변동량 표기(퍼센트 단위)
returns
# 계산식 = (현재행-이전행)/현재행

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [24]:
returns.AAPL.corr(returns.GOOG) # 상관 관계 : 비례|반비례
# 애플이 올랐을 때 구글도 올랐나. 유사할수록 높아지고(1에 가까워짐) 유사하지 않을수록 0에 가까워짐
# 양의 상관관계 = 비례
# 음의 상관관계 = 반비례
# 0.2 미만은 상관관계가 굉장히 낮음(무시할 정도)
# 0.2~0.4 낮음
# 0.4~0.6 다소 높음
# 0.6~0.8 높은 상관관계(영향이 굉장히 큼)
# 0.8~ 거의 같은 데이터(영향이 확실하다.)

0.40791857616797006

In [28]:
returns.AAPL.corr(returns.IBM)

0.38681743611390984

In [30]:
returns.AAPL.corr(returns.MSFT)

0.3896945862805785

In [32]:
returns.MSFT.corr(returns.IBM)

0.4997636114415114

In [34]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [44]:
volume
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [45]:
returns.corrwith(volume)  # 열간 상관 관계

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [4]:
obj = pd.Series(['c','a','d','a','b','d','c','a','b'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [49]:
obj.value_counts()

a    3
c    2
d    2
b    2
Name: count, dtype: int64

In [52]:
obj.to_numpy()

array(['c', 'a', 'd', 'a', 'b', 'd', 'c', 'a', 'b'], dtype=object)

In [6]:
pd.Series(obj.to_numpy()).value_counts()

a    3
c    2
d    2
b    2
Name: count, dtype: int64

In [11]:
7 in obj    # Series의 인덱스 탐색

True

In [15]:
obj[obj.isin(['c','a'])]    # 데이터가 들어있는지 탐색

0    c
1    a
3    a
6    c
7    a
dtype: object

In [17]:
to_match = pd.Series(['c','a','d','a','b','d','c','a','b'])
to_match

0    c
1    a
2    d
3    a
4    b
5    d
6    c
7    a
8    b
dtype: object

In [19]:
unique_values = pd.Series(['c','a','d','b'])
unique_values

0    c
1    a
2    d
3    b
dtype: object

In [21]:
pd.Index(unique_values)

Index(['c', 'a', 'd', 'b'], dtype='object')

In [23]:
pd.Index(unique_values).get_indexer(to_match)
# to_match 데이터에 unique_values 인덱스가 어떻게 배치 되었는지 출력

array([0, 1, 2, 1, 3, 2, 0, 1, 3], dtype=int64)

In [24]:
'''
데이터 프레임과 행렬
공통점 : 2차원
차이점 : 행렬(모든 타입 동일), 데이터프레임(모든 자료의 타입이 비동일할 수 있음, 단 열단위는 같아야 함)
'''

'\n데이터 프레임과 행렬\n공통점 : 2차원\n차이점 : 행렬(모든 타입 동일), 데이터프레임(모든 자료의 타입이 비동일할 수 있음, 단 열단위는 같아야 함)\n'

In [26]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [30]:
data.Qu1.value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [34]:
data.apply(pd.value_counts)

C:\Users\wag19\AppData\Local\Temp\ipykernel_18476\2724425074.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [39]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [41]:
# 경고 문구 제거 코드
import warnings
warnings.filterwarnings(action='ignore')

In [43]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [46]:
data.value_counts() # 행의 형태가 같은 것을 찾아서 개수 표시

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64

In [48]:
pd.read_csv('data/examples/ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [55]:
pd.read_csv('data/examples/ex2.csv', skiprows=2)
pd.read_csv('data/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [57]:
df = pd.read_csv('data/examples/ex2.csv', header=None)
df.columns = list('abcde')
df

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [59]:
# 한 줄 처리
pd.read_csv('data/examples/ex2.csv', header=None, names=['a','b','c','d','messages'])

   a   b   c   d messages
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [61]:
pd.read_csv('data/examples/ex2.csv', header=None, names=['a','b','c','d','messages'], index_col='messages')

          a   b   c   d
messages
hello     1   2   3   4
world     5   6   7   8
foo       9  10  11  12

In [64]:
df = pd.read_csv('data/examples/csv_mindex.csv', index_col=['key1','key2'])

In [66]:
df.value1

key1  key2
one   a        1
      b        3
      c        5
      d        7
two   a        9
      b       11
      c       13
      d       15
Name: value1, dtype: int64

In [70]:
pd.read_csv('data/examples/ex3.txt', sep='\s+') # 공백으로 분리

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [78]:
pd.read_csv('data/examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [85]:
pd.read_csv('data/examples/ex5.csv', na_values=[1,2,5,6,])
# na_values에 들어간 데이터를 NaN으로 변환

  something    a     b     c   d message
0       one  NaN   NaN   3.0   4     NaN
1       two  NaN   NaN   NaN   8   world
2     three  9.0  10.0  11.0  12     foo

In [88]:
pd.read_csv('data/examples/ex5.csv', na_filter=False)
# na_filter = NaN을 보여줄것인지

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [92]:
pd.read_csv('data/examples/ex5.csv').fillna('a')

  something  a   b     c   d message
0       one  1   2   3.0   4       a
1       two  5   6     a   8   world
2     three  9  10  11.0  12     foo

In [96]:
df = pd.read_csv('data/examples/ex6.csv')
df.info() # print 출력
df.head() # return 출력

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     10000 non-null  float64
 1   two     10000 non-null  float64
 2   three   10000 non-null  float64
 3   four    10000 non-null  float64
 4   key     10000 non-null  object
dtypes: float64(4), object(1)
memory usage: 390.8+ KB

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [98]:
# 부족한 메모리 및 빅데이터 읽는 방법
# 1. 큰 메모리 구매
# 2. 분산 환경 구성
# 3. 빅데이터 쪼개서 읽기(지금 진행할 것)

In [102]:
for cnt, chunk in enumerate(pd.read_csv('data/examples/ex6.csv', chunksize=1000)):
    if cnt == 1:
        print(cnt,chunk)
        break

1            one       two     three      four key
1000  0.467976 -0.038649 -0.295344 -1.824726   T
1001 -0.358893  1.404453  0.704965 -0.200638   J
1002 -0.501840  0.659254 -0.421691 -0.057688   R
1003  0.204886  1.074134  1.388361 -0.982404   S
1004  0.354628 -0.133116  0.283763 -0.837063   B
...        ...       ...       ...       ...  ..
1995  2.311896 -0.417070 -1.409599 -0.515821   L
1996 -0.479893 -0.650419  0.745152 -0.646038   J
1997  0.523331  0.787112  0.486066  1.093156   V
1998 -0.362559  0.598894 -1.843201  0.887292   W
1999 -0.096376 -1.012999 -0.657431 -0.573315   D

[1000 rows x 5 columns]

In [126]:
chunker = pd.read_csv('data/examples/ex6.csv', chunksize=1000)
print(type(chunker))
print((chunker)) # 메모리 주소만 보여줌

<class 'pandas.io.parsers.readers.TextFileReader'>
<pandas.io.parsers.readers.TextFileReader object at 0x0000016F61EFD390>

In [113]:
tot = pd.Series([], dtype='int64')
tot

Series([], dtype: int64)

In [125]:
for piece in chunker:
    tot.add(piece.key.value_counts(), fill_value=0)
    print(piece.key.value_counts())

In [119]:
ser1 = pd.Series([10,20])
ser1

0    10
1    20
dtype: int64

In [124]:
tot.add(ser1,fill_value=0)

0    10.0
1    20.0
dtype: float64

In [129]:
# key 열에 대해 문자별 빈도수 출력
tot - pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece.key.value_counts(), fill_value=0)
tot

key
0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [134]:
df = pd.read_csv('data/examples/ex7.csv')
print(df.columns)
print(df.index)
print(df.values)

Index(['a', 'b', 'c'], dtype='object')
RangeIndex(start=0, stop=2, step=1)
[[1 2 3]
 [1 2 3]]

In [136]:
# 다른 방식으로 파일 열기
import csv
reader = csv.reader(open('data/examples/ex7.csv'))

In [138]:
for line in reader :
    print(line)

In [139]:
# json 파일 읽는법
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [146]:
import json
res = json.loads(obj)   # obj에 저장된 dict 구조의 문자열을 읽고 json 형식으로 변환
print(type(res))
res['siblings'][0]['name']

<class 'dict'>

'Scott'

In [148]:
asjson = json.dumps(res)
asjson  # 문자열로 변환됨

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [151]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [157]:
data = pd.read_json('data/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [159]:
data.to_csv('data_to_csv.csv', index=False)

In [161]:
data.to_json('data_to_json.json')

In [163]:
pip install lxml

Collecting lxml
  Downloading lxml-5.2.2-cp311-cp311-win_amd64.whl.metadata (3.5 kB)
Downloading lxml-5.2.2-cp311-cp311-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB 435.7 kB/s eta 0:00:09
    --------------------------------------- 0.1/3.8 MB 469.7 kB/s eta 0:00:08
   --- ------------------------------------ 0.3/3.8 MB 2.0 MB/s eta 0:00:02
   --------- ------------------------------ 0.9/3.8 MB 4.2 MB/s eta 0:00:01
   ------------ --------------------------- 1.2/3.8 MB 4.8 MB/s eta 0:00:01
   ---------------- ----------------------- 1.6/3.8 MB 5.3 MB/s eta 0:00:01
   -------------------- ------------------- 2.0/3.8 MB 6.0 MB/s eta 0:00:01
   ------------------------ --------------- 2.3/3.8 MB 6.2 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 6.4 MB/s eta 0:00:01
   -------------------------------- ------- 3.1/3.8 MB 6.6 MB/s eta 0:00:01
   ------------------------------------- -- 3.6/3.8 MB 6.9 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 6.8 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.2.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [166]:
tables = pd.read_html('data/examples/fdic_failed_bank_list.html')
tables[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [177]:
pd.read_excel('data/examples/ex1.xlsx', index_col=0)
pd.read_excel('data/examples/ex1.xlsx').drop('Unnamed: 0', axis=1)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [188]:
ex1 = pd.read_excel('data/examples/ex1.xlsx', index_col=0, sheet_name='Sheet1') # Sheet1

In [190]:
# 엑셀 저장
ex1.to_excel('ex1_copy.xlsx', sheet_name='MySheet1')

In [1]:
# 연습 문제
# *titanic 데이터셋에 다음 작업을 수행하시오.
import pandas as pd
import numpy as np

df = pd.read_csv('data/titanic/train.csv')
# 1. 승선항구가 'C'인 자료만 추출하시오.
# 2. SibSp + Parch 의 합이 0인 자료만 추출하시오.
# 3. Pclass가 1인 자료만 추출하시오.
# 4. Fare 열 값이 20이상 50미만인 자료만 추출하시오.

In [ ]:
# https://finance.yahoo.com/?guccounter=1
# 005930.KS.csv
# 2024년도 삼성전자 주가데이터를 가져온 다음 아래와 같은 작업을 수행하시오.
# 1) 각 열 단위로 최대값을 출력하시오.
# 2) 각 열 단위로 최소값을 출력하시오.
# 3) 각 열 단위로 출력하시오.
# 4) 각 열 단위로 출력하시오.